import subprocess
import glob2
import os

# تشغيل السكريبتات
scripts = [
r"أخطاء الوسم بالفعل اللازم.py",
r"المتعدي بالحرف مع المتعدي.py",
r"تكرر الكلمات المتجاورات.py",
r"أخطاء إملائية.py",
r"أرقام الصفحات.py",
r"إضافة الفاعل للفعل اللازم.py",
r"الإحالة.py",
r"الاسم المفعول-الأفعال المتعدية.py",
r"التقاء ساكنين.py",
r"الممنوع من الصرف.py",
r"تاريخ استعمال بعد 1880.py",
r"تاريخ استعمال دون ملاحظة نشر.py",
r"تشكيل مكرر.py",
r"تعريف اسم التفضيل.py",
r"تقدمة للمباني.py",
r"توثيق الآية الداخلي.py",
r"حذف حركات السجع.py",
r"دخول الألف واللام على الفرع.py",
r"دون ضبط.py",
r"قال ليس بعدها فعل مضارع.py",
r"لام التعريف مع سكون.py",
r"ملاحظات النشر.py",
r"وسم اسم التفضيل.py",
r"وسم اسم الزمان.py",
r"وسم اسم الفاعل.py",
r"وسم اسم المرة.py",
r"وسم اسم المفعول.py",
r"وسم اسم المكان.py",
r"وسم اسم الهيئة.py",
r"وسم الاسم المصغر.py",
r"وسم الاسم المنسوب.py",
r"وسم الصفة المشبهة.py",
r"وسم الصفة.py",
r"وسم المصدر الصناعي.py",
r"وسم المصدر الميمي.py",
r"وسم المصدر.py",
r"وسم صيغة المبالغة.py"
]

for script in scripts:
    subprocess.run(["python", script])

# جمع النتائج بعد تشغيل السكريبتات
filenames = glob2.glob('*.txt')  # قائمة بكل الملفات ذات الامتداد .txt في الدليل

# نقوم بفلترة القائمة لإزالة أي ملف يحتوي على "جذاذة" في اسمه
filtered_filenames = [file for file in filenames if "جذاذة" not in file]

with open('الملاحظات.txt', 'w') as f:
    for file in filtered_filenames:
        with open(file) as infile:
            f.write(infile.read()+'\n')

# حذف الملفات التي تم جمعها
for file in filtered_filenames:
    # نتأكد من أن الملف ليس "جذاذة.txt" أو "outfile.txt" قبل حذفه
    if file not in ["جذاذة.txt", "الملاحظات.txt"]:
        os.remove(file)

