import re

def search_pattern(arabic_text_file, output_file):
  note_line = "-------------------------ملاحظات الممنوع من الصرف --------------------------\n"  # الجملة المطلوب إضافتها
  record_end_pattern = "تاريخ آخر تحديث"
  header_pattern = r'^\w{3,4}[،"]\ .*\،\ .*$'
  desired_patterns = [
    
  r'(?<![\S])[آؤءئأا-ي][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][آؤءئأا-ي][ًٌٍ](?![\S])',   #فَعَالِل
  r'(?<![\S])[آؤءئأا-ي][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][ي][آؤءئأا-ي][ًٌٍ](?![\S])',   #فَعَالِيل
  r'(?<![\S])[آؤءئأا-ي][َ][آؤءئأا-ي][َ][ا][ئ][آؤءئأا-ي][ًٌٍ](?![\S])',   #فَعَائل
  r'(?<![\S])[آؤءئأا-ي][َ][آؤءئأا-ي][َ][ا][و][ِ][ي][آؤءئأا-ي][ًٌٍ](?![\S])',   #فَعَاوِيل
  r'(?<![\S])[آؤءئأا-ي][َ][و][َ][ا][آؤءئأا-ي][آؤءئأا-ي][ًٌٍ](?![\S])',   #فَوَاعل
  r'(?<![\S])[آؤءئأا-ي][َ][و][َ][ا][آؤءئأا-ي][ِ][ي][آؤءئأا-ي][ًٌٍ](?![\S])',   #فَوَاعِيل
  r'(?<![\S])[آؤءئأا-ي][َ][ي][َ][ا][آؤءئأا-ي][ِ][آؤءئأا-ي][ًٌٍ](?![\S])',   #فَيَاعِل
  r'(?<![\S])[آؤءئأا-ي][َ][ي][َ][ا][آؤءئأا-ي][ِ][ي][آؤءئأا-ي][ًٌٍ](?![\S])',   #فَيَاعِيل
  r'(?<![\S])[أ][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][آؤءئأا-ي][ًٌٍ](?![\S])',# أَفَاعِل
  r'(?<![\S])[أ][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][ي][آؤءئأا-ي][ًٌٍ](?![\S])',# أَفَاعِيل
  r'(?<![\S])[ت][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][آؤءئأا-ي][ًٌٍ](?![\S])',   #تَفَاعِل
  r'(?<![\S])[ت][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][ي][آؤءئأا-ي][ًٌٍ](?![\S])',   #تَفَاعِيل
  r'(?<![\S])[م][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][آؤءئأا-ي][ًٌٍ](?![\S])',   #مَفَاعِل
  r'(?<![\S])[م][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][ي][آؤءئأا-ي][ًٌٍ](?![\S])',#مَفَاعِيل
  r'(?<![\S])[ي][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][آؤءئأا-ي][ًٌٍ](?![\S])',   #يَفَاعِل
  r'(?<![\S])[ي][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][ي][آؤءئأا-ي][ًٌٍ](?![\S])',    #يَفَاعِيل
###################################################################################
  r'(?<![\S])[آؤءئأا-ي][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][آؤءئأا-ي][ً][ا](?![\S])',   #فَعَالِلا
  r'(?<![\S])[آؤءئأا-ي][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][ي][آؤءئأا-ي][ً][ا](?![\S])',   #فَعَالِيلا
  r'(?<![\S])[آؤءئأا-ي][َ][آؤءئأا-ي][َ][ا][ئ][آؤءئأا-ي][ً][ا](?![\S])',   #فَعَائلا
  r'(?<![\S])[آؤءئأا-ي][َ][آؤءئأا-ي][َ][ا][و][ِ][ي][آؤءئأا-ي][ً][ا](?![\S])',   #فَعَاوِيلا
  r'(?<![\S])[آؤءئأا-ي][َ][و][َ][ا][آؤءئأا-ي][آؤءئأا-ي][ً][ا](?![\S])',   #فَوَاعلا
  r'(?<![\S])[آؤءئأا-ي][َ][و][َ][ا][آؤءئأا-ي][ِ][ي][آؤءئأا-ي][ً][ا](?![\S])',   #فَوَاعِيلا
  r'(?<![\S])[آؤءئأا-ي][َ][ي][َ][ا][آؤءئأا-ي][ِ][آؤءئأا-ي][ً][ا](?![\S])',   #فَيَاعِلا
  r'(?<![\S])[آؤءئأا-ي][َ][ي][َ][ا][آؤءئأا-ي][ِ][ي][آؤءئأا-ي][ً][ا](?![\S])',   #فَيَاعِيلا
  r'(?<![\S])[أ][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][آؤءئأا-ي][ً][ا](?![\S])',# أَفَاعِلا
  r'(?<![\S])[أ][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][ي][آؤءئأا-ي][ً][ا](?![\S])',# أَفَاعِيلا
  r'(?<![\S])[ت][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][آؤءئأا-ي][ً][ا](?![\S])',   #تَفَاعِلا
  r'(?<![\S])[ت][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][ي][آؤءئأا-ي][ً][ا](?![\S])',   #تَفَاعِيلا
  r'(?<![\S])[م][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][آؤءئأا-ي][ً][ا](?![\S])',   #مَفَاعِلا
  r'(?<![\S])[م][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][ي][آؤءئأا-ي][ً][ا](?![\S])',#مَفَاعِيلا
  r'(?<![\S])[ي][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][آؤءئأا-ي][ً][ا](?![\S])',   #يَفَاعِلا
  r'(?<![\S])[ي][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][ي][آؤءئأا-ي][ً][ا](?![\S])'   #يَفَاعِيلا
###################################################################################
  r'(?<![\S])[ل][ِ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  لِفَعَالِل
  r'(?<![\S])[ل][ِ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  لِفَعَالِيل
  r'(?<![\S])[ل][ِ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?[ا][ئ][آؤءئأا-ي][ًٌٍ](?![\S])',#  لِفَعَائل
  r'(?<![\S])[ل][ِ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?[ا][و][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  لِفَعَاوِيل
  r'(?<![\S])[ل][ِ]?[آؤءئأا-ي][َ]?[و][َ]?[ا][آؤءئأا-ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  لِفَوَاعل
  r'(?<![\S])[ل][ِ]?[آؤءئأا-ي][َ]?[و][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  لِفَوَاعِيل
  r'(?<![\S])[ل][ِ]?[آؤءئأا-ي][َ]?[ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  لِفَيَاعِل
  r'(?<![\S])[ل][ِ]?[آؤءئأا-ي][َ]?[ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  لِفَيَاعِيل
  r'(?<![\S])[ل][ِ]?[أ][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  لِأَفَاعِل
  r'(?<![\S])[ل][ِ]?[أ][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  لِأَفَاعِيل
  r'(?<![\S])[ل][ِ]?[ت][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  لِتَفَاعِل
  r'(?<![\S])[ل][ِ]?[ت][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  لِتَفَاعِيل
  r'(?<![\S])[ل][ِ]?[م][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  لِمَفَاعِل
  r'(?<![\S])[ل][ِ]?[م][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  لِمَفَاعِيل
  r'(?<![\S])[ل][ِ]?[ي][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  لِيَفَاعِل
  r'(?<![\S])[ل][ِ]?[ي][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  لِيَفَاعِيل
  r'(?<![\S])ك[ِ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  كِفَعَالِل
  r'(?<![\S])ك[ِ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  كِفَعَالِيل
  r'(?<![\S])ك[ِ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?[ا][ئ][آؤءئأا-ي][ًٌٍ](?![\S])',#  كِفَعَائل
  r'(?<![\S])ك[ِ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?[ا][و][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  كِفَعَاوِيل
  r'(?<![\S])ك[ِ]?[آؤءئأا-ي][َ]?[و][َ]?[ا][آؤءئأا-ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  كِفَوَاعل
  r'(?<![\S])ك[ِ]?[آؤءئأا-ي][َ]?[و][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  كِفَوَاعِيل
  r'(?<![\S])ك[ِ]?[آؤءئأا-ي][َ]?[ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  كِفَيَاعِل
  r'(?<![\S])ك[ِ]?[آؤءئأا-ي][َ]?[ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  كِفَيَاعِيل
  r'(?<![\S])ك[ِ]?[أ][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  كِأَفَاعِل
  r'(?<![\S])ك[ِ]?[أ][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  كِأَفَاعِيل
  r'(?<![\S])ك[ِ]?[ت][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  كِتَفَاعِل
  r'(?<![\S])ك[ِ]?[ت][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  كِتَفَاعِيل
  r'(?<![\S])ك[ِ]?[م][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  كِمَفَاعِل
  r'(?<![\S])ك[ِ]?[م][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  كِمَفَاعِيل
  r'(?<![\S])ك[ِ]?[ي][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  كِيَفَاعِل
  r'(?<![\S])ك[ِ]?[ي][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  كِيَفَاعِيل
  r'(?<![\S])ب[ِ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  بِفَعَالِل
  r'(?<![\S])ب[ِ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  بِفَعَالِيل
  r'(?<![\S])ب[ِ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?[ا][ئ][آؤءئأا-ي][ًٌٍ](?![\S])',#  بِفَعَائل
  r'(?<![\S])ب[ِ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?[ا][و][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  بِفَعَاوِيل
  r'(?<![\S])ب[ِ]?[آؤءئأا-ي][َ]?[و][َ]?[ا][آؤءئأا-ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  بِفَوَاعل
  r'(?<![\S])ب[ِ]?[آؤءئأا-ي][َ]?[و][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  بِفَوَاعِيل
  r'(?<![\S])ب[ِ]?[آؤءئأا-ي][َ]?[ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  بِفَيَاعِل
  r'(?<![\S])ب[ِ]?[آؤءئأا-ي][َ]?[ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  بِفَيَاعِيل
  r'(?<![\S])ب[ِ]?[أ][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  بِأَفَاعِل
  r'(?<![\S])ب[ِ]?[أ][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  بِأَفَاعِيل
  r'(?<![\S])ب[ِ]?[ت][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  بِتَفَاعِل
  r'(?<![\S])ب[ِ]?[ت][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  بِتَفَاعِيل
  r'(?<![\S])ب[ِ]?[م][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  بِمَفَاعِل
  r'(?<![\S])ب[ِ]?[م][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',#  بِمَفَاعِيل
  r'(?<![\S])ب[ِ]?[ي][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[آؤءئأا-ي][ًٌٍ](?![\S])',#  بِيَفَاعِل
  r'(?<![\S])ب[ِ]?[ي][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][ًٌٍ](?![\S])',  ]#  بِيَفَاعِيل
###################################################################################
#r'(?<![\S])[آؤءئأا-ي][َ][آؤءئأا-ي][َ][آؤءئأا-ي][َ]?ة[ًٌٍ](?![\S])',   #فَعَلَة
#r'(?<![\S])[آؤءئأا-ي][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ًٌٍ](?![\S])',   #فَعَال
#r'(?<![\S])[آؤءئأا-ي][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][َ]?ى(?![\S])',   #فَعَالَى
#r'(?<![\S])[آؤءئأا-ي][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][ي](?![\S])',   #فَعَالِي
#r'(?<![\S])[آؤءئأا-ي][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ِ][ي][ّ]?(?![\S])',   #فَعَالِيّ
#r'(?<![\S])[آؤءئأا-ي][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ]?ى(?![\S])',   #فَعْلَى
#r'(?<![\S])[آؤءئأا-ي][ُ][آؤءئأا-ي][َ][آؤءئأا-ي][ًٌٍ](?![\S])',   #فُعَل
#r'(?<![\S])[آؤءئأا-ي][ُ][آؤءئأا-ي][َ][آؤءئأا-ي][َ][ا][ء][ًٌٍ](?![\S])',   #فُعَلَاء
#r'(?<![\S])[آؤءئأا-ي][ُ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][َ]?ى(?![\S])',   #فُعَالَى
#r'(?<![\S])[آؤءئأا-ي][ُ][آؤءئأا-ي][َ][ّ][ا][آؤءئأا-ي][ًٌٍ](?![\S])',   #فُعَّال
#r'(?<![\S])[آؤءئأا-ي][ُ][آؤءئأا-ي][ُ][آؤءئأا-ي][ًٌٍ](?![\S])',   #فُعُل
#r'(?<![\S])[آؤءئأا-ي][ُ][آؤءئأا-ي][ُ][و][آؤءئأا-ي][ًٌٍ](?![\S])',   #فُعُول
#r'(?<![\S])[آؤءئأا-ي][ُ][آؤءئأا-ي][ّ][َ][آؤءئأا-ي][ًٌٍ](?![\S])',   #فُعَّل
#r'(?<![\S])[آؤءئأا-ي][ُ][آؤءئأا-ي][ْ][آؤءئأا-ي][ًٌٍ](?![\S])',   #فُعْل
#r'(?<![\S])[آؤءئأا-ي][ُ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ][ا][ن][ًٌٍ](?![\S])',   #فُعْلَان
#r'(?<![\S])[آؤءئأا-ي][ِ][آؤءئأا-ي][َ][آؤءئأا-ي][ًٌٍ](?![\S])',   #فِعَل
#r'(?<![\S])[آؤءئأا-ي][ِ][آؤءئأا-ي][َ][آؤءئأا-ي][َ]?ة[ًٌٍ](?![\S])',   #فِعَلَة
#r'(?<![\S])[آؤءئأا-ي][ِ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ًٌٍ](?![\S])',   #فِعَال
#r'(?<![\S])[آؤءئأا-ي][ِ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ]?ة[ًٌٍ](?![\S])',   #فِعْلَة
#r'(?<![\S])[آؤءئأا-ي][ِ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ][ا][ن][ًٌٍ](?![\S])',   #فِعْلَان
#r'(?<![\S])[أ][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ًٌٍ](?![\S])',   #أَفْعَال
#r'(?<![\S])[أ][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][ُ][آؤءئأا-ي][ًٌٍ](?![\S])',   #أَفْعُل
#r'(?<![\S])[أ][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][ِ][آؤءئأا-ي][َ]?ة[ًٌٍ](?![\S])',   #أَفْعِلَة
#r'(?<![\S])[أ][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][ِ][آؤءئأا-ي][َ][ا][ء][ًٌٍ](?![\S])',  #أَفْعِلَاء
  
  pattern1_with_q = r'ن?\d{1,4}ق\.هـ/\d{1,4}م'
  pattern1_without_q = r'ن?\d{1,4}هـ/\d{1,4}م' 

  full_text = arabic_text_file.read()
  records = full_text.split(record_end_pattern)
  output_file.write(note_line)
  
  for record in records:
    # يجب إعادة تحديد المطابقة لكل سجل
    header_match = re.search(header_pattern, record, re.MULTILINE)
    if header_match:
      header = header_match.group(0).strip()
      lines = record.split('\n')
      for line in lines:
        if (line.startswith('"') or line.endswith('"') or
            re.match(pattern1_with_q, line) or re.match(pattern1_without_q, line)):
          for pattern in desired_patterns:
            matches = re.finditer(pattern, line)
            for match in matches:
              formatted_line = f"{header}\n{match.group(0)} = {line.strip()}"
              output_file.write(formatted_line + "\n\n")

# تأكد من أن الأنماط صحيحة والمسارات مطابقة للملفات الحقيقية
with open("جذاذة.txt", encoding="utf8") as arabic_text_file:
  with open("الممنوع من الصرف.txt", 'w', encoding='utf-8') as output_file:  
    search_pattern(arabic_text_file, output_file)
