import re

def extract_specific_records(input_file):
    # نمط البحث عن الخاصية الجديدة
    new_pattern = r'^\w{3,4}\،\ .*\،\ اسْمُ فَاعِل$'
    
    # قائمة بالأنماط التي ترغب في التحقق منها
    specific_word_patterns = [
        r'[آءؤئأا-ي]َ[ا][آءؤئأا-ي]ِ[آءؤئأا-ي]',
        r'[آءؤئأا-ي]َ[ا][آءؤئأا-ي]ّ',
        r'[م][ُ]?[آءؤئأا-ي][ِ]?[ي][آءؤئأا-ي]',
        r'[م][ُ]?[آءؤئأا-ي][ْ]?ط[َ]?[آءؤئأا-ي][ِ]?[آءؤئأا-ي]',
        r'[م][ُ]?[آءؤئأا-ي][ّ]?[َ]?[ا][آءؤئأا-ي]',
        r'[م][ُ]?[آءؤئأا-ي][ّ]?[َ]?[آءؤئأا-ي][ِ]?[آءؤئأا-ي]',
        r'[آ[آءؤئأا-ي][ِ]?[آءؤئأا-ي]',
        r'[م][ُ]?[آءؤئأا-ي][ْ]?د[َ]?[آءؤئأا-ي][ِ]?[آءؤئأا-ي]',
        r'[م][ُ]?[آءؤئأا-ي][ْ]?[آءؤئأا-ي][َ]?[آءؤئأا-ي][ّ]?',
        r'[م][ُ]?[آءؤئأا-ي][ِ]?[آءؤئأا-ي][ّ]?',
        r'[م]ُ[آءؤئأا-ي]ْ[آءؤئأا-ي]ِ[آءؤئأا-ي]',
        r'[آءؤئأا-ي][َ][ا][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[آءؤئأا-ي][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][آءؤئأا-ي][ّ][ِ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][آءؤئأا-ي][ّ][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][ا][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][ا][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][س][ْ][ت][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][ت][َ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][ن][ْ][آءؤئأا-ي][َ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي][ّ]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][و][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][و][ّ][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][و][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][و][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][ن][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][ن][ِ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][ن][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][آءؤئأا-ي][ِ][آءؤئأا-ي][ّ]',
        r'[م][ُ][ت][َ][م][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][و][ِ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][و][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م]ُ[ت]َ[آءؤئأا-ي]َ[ي]ْ[آءؤئأا-ي]ِ[آءؤئأا-ي]',
        r'[م][ُ]?[آؤءئأا-ي][ّ]?[َ]?[آؤءئأا-ي][ّ]?[ِ]?[آؤءئأا-ي]',
        r'[م][ُ]?[ت][َ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][ّ]?[ِ]?[ي]'
    ]

    results = []

    with open(input_file, 'r', encoding='utf-8') as f:
        records = f.read().split('تاريخ آخر تحديث')

    for record in records:
        lines = record.split('\n')
        matched = False  # flag to check if any pattern matched
        
        for i, line in enumerate(lines):
            if re.search(new_pattern, line):
                # الحصول على النص بين الفاصلة الأولى والثانية
                extracted_word = line.split('،')[1].strip()
                for pattern in specific_word_patterns:
                    if re.search(pattern, extracted_word):
                        matched = True
                        break
                if not matched:
                    results.append(line)

        if matched:
            continue

    return results

# تنفيذ الوظيفة
specific_records = extract_specific_records("جذاذة.txt")
intro_sentence = "-------------------------مراجعة وسم اسم الفاعل----------------------------"

# حفظ النتائج في ملف جديد
with open("خطأ في وسم اسم الفاعل.txt", 'w', encoding='utf-8') as f:
    f.write(intro_sentence + '\n\n')
    f.write('\n'.join(specific_records))
