import re

def extract_specific_records(input_file):
    # نمط البحث عن الخاصية الجديدة
    new_pattern = r'^\w{3,4}\،\ .*\،\ مَصْدَرٌ مِيمِيّ$'
    
    # قائمة بالأنماط التي ترغب في التحقق منها
    specific_word_patterns = [
                r'[م][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ]ى',
                r'[م][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ][آؤءئأا-ي]',
                r'[م][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][ِ][آؤءئأا-ي]',
                r'[م][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي]',
                r'[م][ُ][ن][ْ][آؤءئأا-ي][َ][آؤءئأا-ي][َ][آؤءئأا-ي]',
                r'[م][ُ][آؤءئأا-ي][ْ][ت][َ][آؤءئأا-ي][َ]ى',
                r'[م][َ][ءؤئأا-ي][ْ][ءؤئأا-ي][َ][ءؤئأا-ي]',
                r'[م][َ][ءؤئأا-ي][ْ][ءؤئأا-ي][ِ][ءؤئأا-ي]',
                r'[م][َ][ءؤئأا-ي][ِ][ي][][ءؤئأا-ي]',
                r'[م][َ]آ[آءؤئأا-ي][َ]ة',
                r'[م][ُ][آءؤئأا-ي][ْ][ت][َ][ن][َ]ى',
                r'[م][َ][آءؤئأا-ي][َ][آءؤئأا-ي][ّ]',
                r'[م][ُ][آءؤئأا-ي][ْ][ت][َ][آءؤئأا-ي][َ][آءؤئأا-ي]',
                r'[م][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ][آؤءئأا-ي][َ]ة',
                r'[م][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][َ]ة',
                r'[م][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][ِ][آؤءئأا-ي][َ]ة',
                r'[م][َ][آؤءئأا-ي][ِ][ي][آؤءئأا-ي]',
                r'[م][َ][آؤءئأا-ي][َ][آؤءئأا-ي][ّ]',
                r'[م][ُ][ت][َ][آؤءئأا-ي][َ][آؤءئأا-ي][ّ][َ]',
                r'[م][َ]آ[آؤءئأا-ي]',
                r'[م][ُ][آؤءئأا-ي][ّ][َ][آؤءئأا-ي][َ][آؤءئأا-ي]',
                r'[م][ُ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ][آؤءئأا-ي][ّ]',
                r'[م][ُ][آؤءئأا-ي][ْ]ط[َ][آؤءئأا-ي][َ][آؤءئأا-ي]',
                r'(?<![\S])[م][ُ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][َ][آؤءئأا-ي](?![\S])', 
                r'[م][ُ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ][آؤءئأا-ي]',
                r'[م][ُ][س][ْ][ت][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ][آؤءئأا-ي]',
                r'[م][ُ][ت][َ][آؤءئأا-ي][َ][آؤءئأا-ي][ّ][َ][آؤءئأا-ي]',                
                r'[م][ُ][آؤءئأا-ي][ْ][ت][َ][آؤءئأا-ي][َ][آؤءئأا-ي]'


    ]

    results = []

    with open(input_file, 'r', encoding='utf-8') as f:
        records = f.read().split('تاريخ آخر تحديث')

    for record in records:
        lines = record.split('\n')
        matched = False  # flag to check if any pattern matched
        
        for i, line in enumerate(lines):
            if re.search(new_pattern, line):
                # الحصول على النص بين الفاصلة الأولى والثانية
                extracted_word = line.split('،')[1].strip()
                for pattern in specific_word_patterns:
                    if re.search(pattern, extracted_word):
                        matched = True
                        break
                if not matched:
                    results.append(line)

        if matched:
            continue

    return results

# تنفيذ الوظيفة
specific_records = extract_specific_records("جذاذة.txt")
intro_sentence = "--------------------------ملاحظات على المصدر الميمي--------------------------\n"

# حفظ النتائج في ملف جديد
with open("خطأ في وسم المصدر الميمي.txt", 'w', encoding='utf-8') as f:
    f.write(intro_sentence + '\n')
    f.write('\n'.join(specific_records))
