import re
def extract_specific_records(input_file):
    # نمط البحث عن الخاصية الجديدة
    new_pattern = r'^\w{3,4}\،\ .*\،\ صِفَة$'
    # نمط للتحقق من النتائج قبل طباعتها
    filter_pattern = r'^\w{3,4}\،\ .+يّ\،\ صِفَة$'
    # قائمة بالأنماط التي ترغب في التحقق منها
    specific_word_patterns = [
####################اسم المفعول######################################
        r'[م][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][ُ][و][آءؤئأا-ي]',
        r'[آءؤئأا-ي]َ[ا][آءؤئأا-ي]ِ[آءؤئأا-ي]',
        r'[آءؤئأا-ي]َ[ا][آءؤئأا-ي]ّ',
        r'[م][ُ][ت][َ][ءؤئأا-ي][َ][ءؤئأا-ي][ّ][َ]ى',
        r'[م][ُ][و][ءؤئأا-ي][َ]ى',
        r'[م][ُ]?[ءؤئأا-ي][َ]?[ا][ءؤئأا-ي]',
        r'[م][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][ُ][و][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][آءؤئأا-ي][ّ][َ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][آءؤئأا-ي][ّ][َ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][ا][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][ا][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][ُ][س][ْ][ت][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][ت][َ][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][ُ][ن][ْ][آءؤئأا-ي][َ][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][آءؤئأا-ي][ّ]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][و][ْ][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][و][ّ][َ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][و][ْ][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][و][َ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][ي][ْ][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][ي][َ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][ن][ْ][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][ن][َ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][ن][ْ][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][آءؤئأا-ي][َ][آءؤئأا-ي][ّ]',
        r'[م][ُ][ت][َ][م][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][و][َ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][و][ْ][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][ي][َ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][ي][ْ][آءؤئأا-ي][َ][آءؤئأا-ي]',
####################اسم الفاعل######################################
        r'[آءؤئأا-ي]َ[ا][آءؤئأا-ي]ِ[آءؤئأا-ي]',
        r'[آءؤئأا-ي]َ[ا][آءؤئأا-ي]ّ',
        r'[م][ُ]?[آءؤئأا-ي][ِ]?[ي][آءؤئأا-ي]',
        r'[م][ُ]?[آءؤئأا-ي][ْ]?ط[َ]?[آءؤئأا-ي][ِ]?[آءؤئأا-ي]',
        r'[م][ُ]?[آءؤئأا-ي][ّ]?[َ]?[ا][آءؤئأا-ي]',
        r'[م][ُ]?[آءؤئأا-ي][ّ]?[َ]?[آءؤئأا-ي][ِ]?[آءؤئأا-ي]',
        r'[آ[آءؤئأا-ي][ِ]?[آءؤئأا-ي]',
        r'[م][ُ]?[آءؤئأا-ي][ْ]?د[َ]?[آءؤئأا-ي][ِ]?[آءؤئأا-ي]',
        r'[م][ُ]?[آءؤئأا-ي][ْ]?[آءؤئأا-ي][َ]?[آءؤئأا-ي][ّ]?',
        r'[م][ُ]?[آءؤئأا-ي][ِ]?[آءؤئأا-ي][ّ]?',
        r'[م]ُ[آءؤئأا-ي]ْ[آءؤئأا-ي]ِ[آءؤئأا-ي]',
        r'[آءؤئأا-ي][َ][ا][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[آءؤئأا-ي][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][آءؤئأا-ي][ّ][ِ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][آءؤئأا-ي][ّ][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][ا][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][ا][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][س][ْ][ت][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][ت][َ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][ن][ْ][آءؤئأا-ي][َ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي][ّ]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][و][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][و][ّ][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][و][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][و][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][ن][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][ن][ِ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][ن][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][آءؤئأا-ي][ِ][آءؤئأا-ي][ّ]',
        r'[م][ُ][ت][َ][م][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][و][ِ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][و][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][آءؤئأا-ي][ْ][ي][ِ][آءؤئأا-ي]',
        r'[م][ُ][ت][َ][آءؤئأا-ي][َ][ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[م]ُ[ت]َ[آءؤئأا-ي]َ[ي]ْ[آءؤئأا-ي]ِ[آءؤئأا-ي]',
####################المصغر######################################
        r'[آءؤئأا-ي]َ[ا][آءؤئأا-ي]ّ',
        r'[آءؤئأا-ي][ُ]?[آءؤئأا-ي][َ]?[ي][ّ]?[ِ]?[آءؤئأا-ي]',
        r'[آءؤئأا-ي][ُ]?[آءؤئأا-ي][َ]?[ي][ّ]?[ِ]?[آءؤئأا-ي]',
        r'[آءؤئأا-ي][ُ]?[و][ّ]?[َ]?[ي][ْ]?[آءؤئأا-ي][ِ]?[آءؤئأا-ي]',
        r'[آءؤئأا-ي][ُ][آءؤئأا-ي][َ][ي][ْ][آءؤئأا-ي]',
        r'[آءؤئأا-ي][ُ][آءؤئأا-ي][َ][ي][ّ]',
        r'[آءؤئأا-ي][ُ][آءؤئأا-ي][َ][ي][ْ][آءؤئأا-ي][ِ][ي][آءؤئأا-ي]',
        r'[آءؤئأا-ي][ُ][و][َ][ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي]',
        r'[آءؤئأا-ي][ُ][و][َ][ي][ْ][آءؤئأا-ي][ِ][ي][آءؤئأا-ي]',
        r'[ا][آءؤئأا-ي][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي][ّ][َ][ا][آءؤئأا-ي]',
        r'[ا][آءؤئأا-ي][ْ][آءؤئأا-ي][ِ][ن][ْ][آءؤئأا-ي][َ][ا][آءؤئأا-ي]',
####################اسم الهيئة######################################
        r'إ[ِ][ءؤئأا-ي][َ][ا][ءؤئأا-ي][َ]ة',
        r'[آءؤئأا-ي][ِ][ي][آءؤئأا-ي][َ]ة',
        r'[آءؤئأا-ي][ِ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ]ة',
        r'[آءؤئأا-ي][ِ][آءؤئأا-ي][ّ][َ]ة',
        r'[آءؤئأا-ي][ِ][ي][آءؤئأا-ي][َ]ة',      
####################اسم المرة######################################
        r'[آءؤئأا-ي][َ][آءؤئأا-ي][ّ][َ][ة]',
	r'[آءؤئأا-ي][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][ة]',
        r'إ[ِ][آءؤئأا-ي][َ][ا][آءؤئأا-ي][َ]ة',
        r'[ا][آءؤئأا-ي][ْ][ت][ِ][آءؤئأا-ي][َ][ا][آءؤئأا-ي][َ]ة',
        r'إ[ِ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][ا][آءؤئأا-ي][َ]ة',
        r'[ا][ن][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي][َ][ا][آءؤئأا-ي][َ]ة',
        r'إ[ِ][ي][آءؤئأا-ي][َ][ا][آءؤئأا-ي][َ]ة',
	r'[ت][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][ِ][ي][آءؤئأا-ي][َ][ة]',
####################ااسم الزمان######################################
        r'[م][َ][ءؤئأا-ي][ْ][ءؤئأا-ي][َ][ءؤئأا-ي]',
        r'[م][َ][ءؤئأا-ي][ْ][ءؤئأا-ي][ِ][ءؤئأا-ي]',
        r'[م][َ][ءؤئأا-ي][ِ][ي][][ءؤئأا-ي]',
####################اسم المكان######################################
        r'[م][َ][ءؤئأا-ي][ْ][ءؤئأا-ي][َ][ءؤئأا-ي]',
        r'[م][َ][ءؤئأا-ي][ْ][ءؤئأا-ي][ِ][ءؤئأا-ي]',
        r'[م][َ]آ[آءؤئأا-ي][َ]ة',
        r'[م][ُ][آءؤئأا-ي][ْ][ت][َ][ن][َ]ى',
        r'[م][َ][آءؤئأا-ي][َ][آءؤئأا-ي][ّ]',
        r'[م][ُ][آءؤئأا-ي][ْ][ت][َ][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][َ][ءؤئأا-ي][ِ][ي][][ءؤئأا-ي]'
####################المصدر الميمي######################################
        r'[م][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ]ى',
        r'[م][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ][آؤءئأا-ي]',
        r'[م][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][ِ][آؤءئأا-ي]',
        r'[م][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي]',
        r'[م][ُ][ن][ْ][آؤءئأا-ي][َ][آؤءئأا-ي][َ][آؤءئأا-ي]',
        r'[م][ُ][آؤءئأا-ي][ْ][ت][َ][آؤءئأا-ي][َ]ى',
        r'[م][َ][ءؤئأا-ي][ْ][ءؤئأا-ي][َ][ءؤئأا-ي]',
        r'[م][َ][ءؤئأا-ي][ْ][ءؤئأا-ي][ِ][ءؤئأا-ي]',
        r'[م][َ][ءؤئأا-ي][ِ][ي][][ءؤئأا-ي]',
        r'[م][َ]آ[آءؤئأا-ي][َ]ة',
        r'[م][ُ][آءؤئأا-ي][ْ][ت][َ][ن][َ]ى',
        r'[م][َ][آءؤئأا-ي][َ][آءؤئأا-ي][ّ]',
        r'[م][ُ][آءؤئأا-ي][ْ][ت][َ][آءؤئأا-ي][َ][آءؤئأا-ي]',
        r'[م][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ][آؤءئأا-ي][َ]ة',
        r'[م][َ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][َ]ة',
        r'[م][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][ِ][آؤءئأا-ي][َ]ة',
        r'[م][َ][آؤءئأا-ي][ِ][ي][آؤءئأا-ي]',
        r'[م][َ][آؤءئأا-ي][َ][آؤءئأا-ي][ّ]',
        r'[م][ُ][ت][َ][آؤءئأا-ي][َ][آؤءئأا-ي][ّ][َ]',
        r'[م][َ]آ[آؤءئأا-ي]',
        r'[م][ُ][آؤءئأا-ي][ّ][َ][آؤءئأا-ي][َ][آؤءئأا-ي]',
        r'[م][ُ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ][آؤءئأا-ي][ّ]',
        r'[م][ُ][آؤءئأا-ي][ْ]ط[َ][آؤءئأا-ي][َ][آؤءئأا-ي]',
        r'[م][ُ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][َ][آؤءئأا-ي]',
        r'[م][ُ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ][آؤءئأا-ي]',
        r'[م][ُ][س][ْ][ت][َ][آؤءئأا-ي][ْ][آؤءئأا-ي][َ][آؤءئأا-ي]',
        r'[م][ُ][ت][َ][آؤءئأا-ي][َ][آؤءئأا-ي][ّ][َ][آؤءئأا-ي]',
        r'[م][ُ][آؤءئأا-ي][ْ][ت][َ][آؤءئأا-ي][َ][آؤءئأا-ي]'
    ]
    results = []
    with open(input_file, 'r', encoding='utf-8') as f:
        records = f.read().split('تاريخ آخر تحديث')
    for record in records:
        lines = record.split('\n')
        for line in lines:
            if re.search(new_pattern, line):
                # الحصول على النص بين الفاصلة الأولى والثانية
                extracted_word = line.split('،')[1].strip()
                for pattern in specific_word_patterns:
                    if re.search(pattern, extracted_word):
                        # التحقق من النمط الإضافي قبل إضافة النتيجة
                        if not re.search(filter_pattern, line):
                            results.append(line)
                        break
    return results
# تنفيذ الوظيفة
specific_records = extract_specific_records("جذاذة.txt")
intro_sentence = "------يُوسَم بالصفة جميعُ الصّفات الّتي لا تدخل ضمن وسم الصّفة المحدّدة (اسم الفاعل، صيغ المبالغة، ------\n"
# حفظ النتائج في ملف جديد
with open("خطأ في وسم الصفة.txt", 'w', encoding='utf-8') as f:
    # كتابة الجملة المطلوبة في البداية
    f.write(intro_sentence + '\n')
    for record in specific_records:
        f.write(record + '\n')
