import re

def extract_records_with_multiple_patterns(input_file):
    # الأنماط الجديدة للبحث
    patterns = [

        r'^\w{3,4}\،\ [آؤءئأا-ي][َ][آؤءئأا-ي][ُ][آؤءئأا-ي][َ]\،\ .*$',# فَعُلَ
        r'^\w{3,4}\،\ [ا][ن][ْ][أآائءؤبثجحخدذرزسشصضطظعغفقكلمنهوي][َ][آؤءئأا-ي][َ][آؤءئأا-ي][َ]\،\ .*$',# انْفَعَلَ
        r'^\w{3,4}\،\ [ا][آؤءئأا-ي][ْ][آؤءئأا-ي][َ][ا][آؤءئأا-ي][ّ][َ]\،\ .*$',# افْعَالَّ
        r'^\w{3,4}\،\ [ا][آؤءئأا-ي][ْ][أآائءؤبثجحخدذرزسشصضطظعغفقكلمنهوي][َ][آؤءئأا-ي][ّ][َ]\،\ .*$',# افْعَلَّ
        r'^\w{3,4}\،\ [ا][آؤءئأا-ي][ْ][أآائءؤبثجحخدذرزسشصضطظعغفقكلمنهوي][َ][آؤءئأا-ي][َ][آؤءئأا-ي][ّ][َ]\،\ .*$',# افْعَلَلَّ
        r'^\w{3,4}\،\ [ا][آؤءئأا-ي][ْ][أآائءؤبثجحخدذرزسشصضطظعغفقكلمنهوي][َ][ن][ْ][آؤءئأا-ي][َ][آؤءئأا-ي][َ]\،\ .*$'# افْعَنْلَلَ
    ]
    # النمط الثاني للمقارنة
    second_pattern = r'^\w{3,4}\،\ .*\،\ لَازِم$'

    results = []

    with open(input_file, 'r', encoding='utf-8') as f:
        records = f.read().split('تاريخ آخر تحديث')

    for record in records:
        lines = record.split('\n')
        for line in lines:
            # تطبيق كل نمط من الأنماط الجديدة
            for pattern in patterns:
                if re.search(pattern, line):
                    # التحقق مما إذا كان السطر لا يطابق النمط الثاني
                    if not re.search(second_pattern, line):
                        results.append(line)
                        break  # الانتقال للسجل التالي بمجرد العثور على تطابق

    return results

# تنفيذ الوظيفة بالأنماط الجديدة
records_to_save = extract_records_with_multiple_patterns("جذاذة.txt")
intro_sentence = "------------------------------راجع وسم هذه الأفعال------------------------------"
# حفظ النتائج في ملف نصي
with open("أخطاء الوسم بالفعل اللازم.txt", 'w', encoding='utf-8') as f:
    f.write(intro_sentence + '\n\n')
    f.write('\n'.join(records_to_save))
