import re

def extract_specific_records(input_file):
    # نمط البحث عن الخاصية الجديدة
    new_pattern = r'^\w{3,4}\،\ .*\،\ مَصْدَر$'
    
    # قائمة بالأنماط التي ترغب في التحقق منها
    specific_word_patterns = [
                r'إ[ِ][ءؤئأا-ي][َ][ا][ءؤئأا-ي][َ]ة',
                r'[ءؤئأا-ي][َ][ءؤئأا-ي][َ][ءؤئأا-ي]',
                r'إ[ِ][ي][ءؤئأا-ي][َ][ا][ءؤئأا-ي]',
                r'[ءؤئأا-ي][ُ][ءؤئأا-ي][ُ][و][ءؤئأا-ي]',
                r'[ءؤئأا-ي][َ][ءؤئأا-ي][َ][ا][ءؤئأا-ي][َ]ة',
                r'[م][ُ][ءؤئأا-ي][َ][ا][ءؤئأا-ي][َ][ءؤئأا-ي][َ]ة',
                r'إ[ِ][ءؤئأا-ي][َ][ا]ة',
                r'[آؤءئأا-ي][َ][آؤءئأا-ي][ِ][ي][آؤءئأا-ي]',
                r'[ءؤئأا-ي][َ][ءؤئأا-ي][َ][ا][ءؤئأا-ي]',
                r'[ءؤئأا-ي][ُ][ءؤئأا-ي][ُ][ءؤئأا-ي]',
                r'[ءؤئأا-ي][َ][ءؤئأا-ي][َ][ا][و][َ]ة',
                r'[ءؤئأا-ي][ِ][ءؤئأا-ي][َ][ءؤئأا-ي]',
                r'إ[ِ][ءؤئأا-ي][َ][ءؤئأا-ي][ْ][ءؤئأا-ي][َ]ة',
                r'إ[ِ][ءؤئأا-ي][ْ][ءؤئأا-ي][َ][ا][ءؤئأا-ي]',
                r'[ا][س][ْ][ت][ِ][ءؤئأا-ي][َ][ا][ءؤئأا-ي]',
                r'[ا][س][ْ][ت][ِ][ءؤئأا-ي][َ][ا][ءؤئأا-ي][َ]ة',
                r'[ا][س][ْ][ت][ِ][ءؤئأا-ي][َ][ءؤئأا-ي][ْ][ءؤئأا-ي][َ]ة',
                r'[ا][س][ْ][ت][ِ][ءؤئأا-ي][ْ][ءؤئأا-ي][َ][ا][ءؤئأا-ي]',
                r'[ا][ءؤئأا-ي][ْ][ت][ِ][ءؤئأا-ي][َ][ا][ءؤئأا-ي]',
                r'[ا][ءؤئأا-ي][ْ][ءؤئأا-ي][ِ][ءؤئأا-ي][َ][ا][ءؤئأا-ي]',
                r'[ا][ءؤئأا-ي][ْ][ءؤئأا-ي][ِ][ن][ْ][ءؤئأا-ي][َ][ا][ءؤئأا-ي]',
                r'[ا][ءؤئأا-ي][ْ][ءؤئأا-ي][ِ][و][ّ][َ][ا][ءؤئأا-ي]',
                r'[ا][ءؤئأا-ي][ْ][ءؤئأا-ي][ِ][ي][ءؤئأا-ي][َ][ا][ءؤئأا-ي]',
                r'[ا][ن][ْ][ءؤئأا-ي][ِ][ءؤئأا-ي][َ][ا][ءؤئأا-ي]',
                r'[ت][َ][ءؤئأا-ي][َ][ا][ءؤئأا-ي]',
                r'[ت][َ][ءؤئأا-ي][َ][ا][ءؤئأا-ي][ي]',
                r'[ت][َ][ءؤئأا-ي][َ][ا][ءؤئأا-ي][ُ][ءؤئأا-ي]',
                r'[ت][َ][ءؤئأا-ي][َ][ءؤئأا-ي][ّ][ُ][ءؤئأا-ي]',
                r'[ت][َ][ءؤئأا-ي][َ][ءؤئأا-ي][ّ][ِ][ي]',
                r'[ت][َ][ءؤئأا-ي][َ][ءؤئأا-ي][ْ][ءؤئأا-ي][ُ][ءؤئأا-ي]',
                r'[ت][َ][ءؤئأا-ي][ْ][ءؤئأا-ي][ِ][ءؤئأا-ي][َ]ة',
                r'[ت][َ][ءؤئأا-ي][ْ][ءؤئأا-ي][ِ][ي][ءؤئأا-ي]',
                r'[ءؤئأا-ي][َ][ءؤئأا-ي][َ][ءؤئأا-ي][َ][ا][ن]',
                r'[ءؤئأا-ي][َ][ءؤئأا-ي][ِ][ي][ءؤئأا-ي]',
                r'[ءؤئأا-ي][َ][ءؤئأا-ي][ْ][ءؤئأا-ي]',
                r'[ءؤئأا-ي][ِ][ءؤئأا-ي][ْ][ءؤئأا-ي][َ][ا][ءؤئأا-ي]',
                r'[ءؤئأا-ي][َ][ءؤئأا-ي][ْ][ءؤئأا-ي][َ][ءؤئأا-ي][َ]ة',
                r'[ءؤئأا-ي][ُ][ءؤئأا-ي][َ][ا][ءؤئأا-ي]',
                r'[ءؤئأا-ي][ُ][ءؤئأا-ي][ُ][و][ءؤئأا-ي][َ]ة',
                r'[ءؤئأا-ي][ُ][ءؤئأا-ي][ْ][ءؤئأا-ي]',
                r'[ءؤئأا-ي][ُ][ءؤئأا-ي][ْ][ءؤئأا-ي][َ]ة',
                r'[ءؤئأا-ي][ِ][ءؤئأا-ي][َ][ا][ءؤئأا-ي]',
                r'[ءؤئأا-ي][ِ][ءؤئأا-ي][َ][ا][ءؤئأا-ي][َ]ة',
                r'[ءؤئأا-ي][ِ][ءؤئأا-ي][ْ][ءؤئأا-ي]',
                r'[ءؤئأا-ي][َ][و][ْ][ءؤئأا-ي][َ][ءؤئأا-ي][َ]ة',
                r'[ءؤئأا-ي][َ][ي][ْ][ءؤئأا-ي][َ][ءؤئأا-ي][َ]ة',
                r'[ءؤئأا-ي][َ][ءؤئأا-ي][ْ][ي][َ][ءؤئأا-ي][َ]ة',
                r'[ءؤئأا-ي][َ][ن][ْ][ءؤئأا-ي][َ][ءؤئأا-ي][َ]ة',
                r'[ءؤئأا-ي][َ][ءؤئأا-ي][ْ][ن][َ][ءؤئأا-ي][َ]ة',
                r'[ءؤئأا-ي][َ][ءؤئأا-ي][ْ][ءؤئأا-ي][َ][ا]ة',
                r'[م][ُ][ءؤئأا-ي][َ][ا][ءؤئأا-ي][َ][ءؤئأا-ي][َ]ة',
                r'[ت][َ][ءؤئأا-ي][َ][ءؤئأا-ي][ْ][ءؤئأا-ي][َ][ءؤئأا-ي]',
                r'[ت][َ][ءؤئأا-ي][َ][و][ْ][ءؤئأا-ي][ُ][ءؤئأا-ي]',
                r'[ت][َ][ءؤئأا-ي][َ][ءؤئأا-ي][ْ][و][ُ][ءؤئأا-ي]',
                r'[ت][َ][ءؤئأا-ي][َ][ي][ْ][ءؤئأا-ي][ُ][ءؤئأا-ي]',
                r'[ت][َ][ءؤئأا-ي][َ][ءؤئأا-ي][ْ][ي][ُ][ءؤئأا-ي]'
    ]

    results = []

    with open(input_file, 'r', encoding='utf-8') as f:
        records = f.read().split('تاريخ آخر تحديث')

    for record in records:
        lines = record.split('\n')
        matched = False  # flag to check if any pattern matched
        
        for i, line in enumerate(lines):
            if re.search(new_pattern, line):
                # الحصول على النص بين الفاصلة الأولى والثانية
                extracted_word = line.split('،')[1].strip()
                for pattern in specific_word_patterns:
                    if re.search(pattern, extracted_word):
                        matched = True
                        break
                if not matched:
                    results.append(line)

        if matched:
            continue

    return results

# تنفيذ الوظيفة
specific_records = extract_specific_records("جذاذة.txt")
intro_sentence = "---------------------------مراجعة وسم المصدر------------------------------"

# حفظ النتائج في ملف جديد
with open("خطأ في وسم المصدر.txt", 'w', encoding='utf-8') as f:
    f.write(intro_sentence + '\n\n')
    f.write('\n'.join(specific_records))
