import re

def extract_specific_records(input_file):
    # نمط البحث عن الخاصية الجديدة
    new_pattern = r'^\w{3,4}\،\ .*\،\ اسْمُ مَرَّة$'
    # قائمة بالأنماط التي ترغب في التحقق منها
    specific_word_patterns = [
	r'[آءؤئأا-ي][َ][آءؤئأا-ي][ّ][َ][ة]',
	r'[آءؤئأا-ي][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][ة]',
	r'إ[ِ][آءؤئأا-ي][َ][ا][آءؤئأا-ي][َ]ة',
	r'[ا][آءؤئأا-ي][ْ][ت][ِ][آءؤئأا-ي][َ][ا][آءؤئأا-ي][َ]ة',
	r'إ[ِ][آءؤئأا-ي][ْ][آءؤئأا-ي][َ][ا][آءؤئأا-ي][َ]ة',
	r'[ا][ن][ْ][آءؤئأا-ي][ِ][آءؤئأا-ي][َ][ا][آءؤئأا-ي][َ]ة',
	r'[آءؤئأا-ي][ِ][آءؤئأا-ي][َ][ا][آءؤئأا-ي][َ]ة',
	r'إ[ِ][ي][آءؤئأا-ي][َ][ا][آءؤئأا-ي][َ]ة',
	r'[ت][َ][آءؤئأا-ي][ْ][آءؤئأا-ي][ِ][ي][آءؤئأا-ي][َ][ة]',
	r'[ت][َ]?[آؤءئأا-ي][ْ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?ة',
	r'[ت][َ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][ّ]?[ُ]?[آؤءئأا-ي][َ]?ة',
	r'[ا][س][ْ]?[ت][ِ]?[آؤءئأا-ي][ْ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][َ]?ة',
	r'[ت][َ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][ُ]?[آؤءئأا-ي][َ]?ة',
	r'[ا][آؤءئأا-ي][ّ]?[ِ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][َ]?ة',
	r'[ا][آؤءئأا-ي][ْ]?[آؤءئأا-ي][ِ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][َ]?ة',
	r'[ا][آؤءئأا-ي][ْ]?ط[ِ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][َ]?ة',
	r'[ا][آؤءئأا-ي][ْ]?[آؤءئأا-ي][ِ]?[آؤءئأا-ي][ْ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][َ]?ة',
	r'[ا][آؤءئأا-ي][ّ]?[ِ]?[آؤءئأا-ي][َ]?[ا][آؤءئأا-ي][َ]?ة',
	r'[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?[ا][ن][َ]?ة',
	r'[أ][َ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?ة',
	r'[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?[آؤءئأا-ي][َ]?ة',
	r'[م][َ]?[آؤءئأا-ي][ِ]?[ي][آؤءئأا-ي][َ]?ة'
      
    ]

    results = []

    with open(input_file, 'r', encoding='utf-8') as f:
        records = f.read().split('تاريخ آخر تحديث')

    for record in records:
        lines = record.split('\n')
        matched = False  # flag to check if any pattern matched
        
        for i, line in enumerate(lines):
            if re.search(new_pattern, line):

                extracted_word = line.split('،')[1].strip()
                for pattern in specific_word_patterns:
                    if re.search(pattern, extracted_word):
                        matched = True
                        break
                if not matched:
                    results.append(line)

            if matched:
                continue

    return results

# تنفيذ الوظيفة
specific_records = extract_specific_records("جذاذة.txt")
intro_sentence = "-------------------------مراجعة وسم اسم المرة----------------------------"

# حفظ النتائج في ملف جديد
with open("خطأ في وسم اسم المرة.txt", 'w', encoding='utf-8') as f:
    f.write(intro_sentence + '\n\n')
    f.write('\n'.join(specific_records))
